MAIN_FISHING_TEXT = """
🎣 <strong>Рыбалка</strong>

Для успешной рыбалки, тебе необходимо купить приманку, на которую ты будешь ловить рыбу
Рыбалка дело не быстрое и требующее хорошей концентрации и терпения

Во время рыбалки, ты будешь вылавливать, как мусор, так и очень крутую и дорогую рыбу
Чтобы улучшить свою удочку, рыбачь как можно больше и ты сможешь выловить запчасти для улучшения удочки или собрать свою собственную лодку

Cоревнование по рыбалке:
{top_users}
У тебя за всё время соревнования {user_fish} шт.

⚙️ Деталей: {user_detail}
🍣 Наживка: {user_bait}
🎣 Удочка: {user_rod}

Твоя рыба:
⚖️ Общий вес {user_fish_weight} кг. ~ {user_fish_price} руб. {money_smile}
"""
