

FIRST_START_TEXT = '<strong>Добро пожаловать в симулятор бомжа.</strong>\n' \
           'Перед началом игры, давай пройдём обучение, чтобы ты лучше ориентировался в игровом процессе.\n' \
           'В игре есть 3 осноных показателя, которые тебе надо постоянно поддерживать:\n\n' \
           '❤ - Здоровье\n' \
           '🍗 - Голод\n' \
           '😄 - Счастье\n\n' \
           'Для восстановления каждого из показателей, выполняй определенные действия, которые ты найдешь в главном меню.\n' \
           'В игре есть две валюты:\n\n' \
           '💰 - Рубли\n' \
           '🍾 - Бутылки\n\n' \
           'Для заработка денег, ты можешь устраиваться на различные работы, которые будут открываться по мере прокачки\n' \
           'Для заработка бутылок, ты можешь рыться по помойкам или участвовать в криминальных делах.' \
           ' Когда твой достаток возрастёт, ты сможешь нанять других бомжей, которые будут искать бутылки за тебя.\n' \
           'Но для найма бомжей, тебе понадобится жильё, в котором ты сможешь их поселить\n\n' \
           'В игре присутствует система уровней. По мере развития персонажа, ты сможешь открыть новые возможности\n' \
           'Прокачивай своего персонажа, чтобы попасть в топ и вырваться на первые места'

NEW_REFERRAL = """
<a href="https://t.me/{username}">{fullname}</a> зашёл в игру по твоей реферальной ссылке\n
При достижении им 3 уровня, ты получишь +2 дня ВИП статуса"""


NEW_LEVEL_TEXT = """
🥳 Ты достиг нового уровня\n
Проверь, возможно тебе открылась новая работа или ты можешь купить более крутое жилье🤷‍♂️😏"""